alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC1400_series/Include/XMC1400.h
/* ----------------------------  SCU_INTERRUPT_SRRAW1  ---------------------------- */
#define SCU_INTERRUPT_SRRAW1_ACMP3I_Pos       (0UL)                     /*!< SCU_INTERRUPT SRRAW1: ACMP3I (Bit 0)                        */
#define SCU_INTERRUPT_SRRAW1_ACMP3I_Msk       (0x1UL)                   /*!< SCU_INTERRUPT SRRAW1: ACMP3I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRRAW1_LOECI_Pos        (1UL)                     /*!< SCU_INTERRUPT SRRAW1: LOECI (Bit 1)                         */
#define SCU_INTERRUPT_SRRAW1_LOECI_Msk        (0x2UL)                   /*!< SCU_INTERRUPT SRRAW1: LOECI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW1_PEU1I_Pos        (2UL)                     /*!< SCU_INTERRUPT SRRAW1: PEU1I (Bit 2)                         */
#define SCU_INTERRUPT_SRRAW1_PEU1I_Msk        (0x4UL)                   /*!< SCU_INTERRUPT SRRAW1: PEU1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW1_PEMCI_Pos        (3UL)                     /*!< SCU_INTERRUPT SRRAW1: PEMCI (Bit 3)                         */
#define SCU_INTERRUPT_SRRAW1_PEMCI_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRRAW1: PEMCI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRRAW1_DCO1OFSI_Pos     (4UL)                     /*!< SCU_INTERRUPT SRRAW1: DCO1OFSI (Bit 4)                      */
#define SCU_INTERRUPT_SRRAW1_DCO1OFSI_Msk     (0x10UL)                  /*!< SCU_INTERRUPT SRRAW1: DCO1OFSI (Bitfield-Mask: 0x01)        */

/* ----------------------------  SCU_INTERRUPT_SRMSK1  ---------------------------- */
#define SCU_INTERRUPT_SRMSK1_ACMP3I_Pos       (0UL)                     /*!< SCU_INTERRUPT SRMSK1: ACMP3I (Bit 0)                        */
#define SCU_INTERRUPT_SRMSK1_ACMP3I_Msk       (0x1UL)                   /*!< SCU_INTERRUPT SRMSK1: ACMP3I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRMSK1_LOECI_Pos        (1UL)                     /*!< SCU_INTERRUPT SRMSK1: LOECI (Bit 1)                         */
#define SCU_INTERRUPT_SRMSK1_LOECI_Msk        (0x2UL)                   /*!< SCU_INTERRUPT SRMSK1: LOECI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK1_PEU1I_Pos        (2UL)                     /*!< SCU_INTERRUPT SRMSK1: PEU1I (Bit 2)                         */
#define SCU_INTERRUPT_SRMSK1_PEU1I_Msk        (0x4UL)                   /*!< SCU_INTERRUPT SRMSK1: PEU1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK1_PEMCI_Pos        (3UL)                     /*!< SCU_INTERRUPT SRMSK1: PEMCI (Bit 3)                         */
#define SCU_INTERRUPT_SRMSK1_PEMCI_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRMSK1: PEMCI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRMSK1_DCO1OFSI_Pos     (4UL)                     /*!< SCU_INTERRUPT SRMSK1: DCO1OFSI (Bit 4)                      */
#define SCU_INTERRUPT_SRMSK1_DCO1OFSI_Msk     (0x10UL)                  /*!< SCU_INTERRUPT SRMSK1: DCO1OFSI (Bitfield-Mask: 0x01)        */

/* ----------------------------  SCU_INTERRUPT_SRCLR1  ---------------------------- */
#define SCU_INTERRUPT_SRCLR1_ACMP3I_Pos       (0UL)                     /*!< SCU_INTERRUPT SRCLR1: ACMP3I (Bit 0)                        */
#define SCU_INTERRUPT_SRCLR1_ACMP3I_Msk       (0x1UL)                   /*!< SCU_INTERRUPT SRCLR1: ACMP3I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRCLR1_LOECI_Pos        (1UL)                     /*!< SCU_INTERRUPT SRCLR1: LOECI (Bit 1)                         */
#define SCU_INTERRUPT_SRCLR1_LOECI_Msk        (0x2UL)                   /*!< SCU_INTERRUPT SRCLR1: LOECI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR1_PEU1I_Pos        (2UL)                     /*!< SCU_INTERRUPT SRCLR1: PEU1I (Bit 2)                         */
#define SCU_INTERRUPT_SRCLR1_PEU1I_Msk        (0x4UL)                   /*!< SCU_INTERRUPT SRCLR1: PEU1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR1_PEMCI_Pos        (3UL)                     /*!< SCU_INTERRUPT SRCLR1: PEMCI (Bit 3)                         */
#define SCU_INTERRUPT_SRCLR1_PEMCI_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRCLR1: PEMCI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRCLR1_DCO1OFSI_Pos     (4UL)                     /*!< SCU_INTERRUPT SRCLR1: DCO1OFSI (Bit 4)                      */
#define SCU_INTERRUPT_SRCLR1_DCO1OFSI_Msk     (0x10UL)                  /*!< SCU_INTERRUPT SRCLR1: DCO1OFSI (Bitfield-Mask: 0x01)        */

/* ----------------------------  SCU_INTERRUPT_SRSET1  ---------------------------- */
#define SCU_INTERRUPT_SRSET1_ACMP3I_Pos       (0UL)                     /*!< SCU_INTERRUPT SRSET1: ACMP3I (Bit 0)                        */
#define SCU_INTERRUPT_SRSET1_ACMP3I_Msk       (0x1UL)                   /*!< SCU_INTERRUPT SRSET1: ACMP3I (Bitfield-Mask: 0x01)          */
#define SCU_INTERRUPT_SRSET1_LOECI_Pos        (1UL)                     /*!< SCU_INTERRUPT SRSET1: LOECI (Bit 1)                         */
#define SCU_INTERRUPT_SRSET1_LOECI_Msk        (0x2UL)                   /*!< SCU_INTERRUPT SRSET1: LOECI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRSET1_PEU1I_Pos        (2UL)                     /*!< SCU_INTERRUPT SRSET1: PEU1I (Bit 2)                         */
#define SCU_INTERRUPT_SRSET1_PEU1I_Msk        (0x4UL)                   /*!< SCU_INTERRUPT SRSET1: PEU1I (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRSET1_PEMCI_Pos        (3UL)                     /*!< SCU_INTERRUPT SRSET1: PEMCI (Bit 3)                         */
#define SCU_INTERRUPT_SRSET1_PEMCI_Msk        (0x8UL)                   /*!< SCU_INTERRUPT SRSET1: PEMCI (Bitfield-Mask: 0x01)           */
#define SCU_INTERRUPT_SRSET1_DCO1OFSI_Pos     (4UL)                     /*!< SCU_INTERRUPT SRSET1: DCO1OFSI (Bit 4)                      */
#define SCU_INTERRUPT_SRSET1_DCO1OFSI_Msk     (0x10UL)                  /*!< SCU_INTERRUPT SRSET1: DCO1OFSI (Bitfield-Mask: 0x01)        */


/* ================================================================================ */
/* ================       struct 'SCU_POWER' Position & Mask       ================ */
/* ================================================================================ */


