alibaba/AliOS-Things/platform/mcu/xmc/Drivers/CMSIS/Infineon/XMC1400_series/Include/XMC1400.h
/* --------------------------------  VADC_G_ARBPR  -------------------------------- */
#define VADC_G_ARBPR_PRIO0_Pos                (0UL)                     /*!< VADC_G ARBPR: PRIO0 (Bit 0)                                 */
#define VADC_G_ARBPR_PRIO0_Msk                (0x3UL)                   /*!< VADC_G ARBPR: PRIO0 (Bitfield-Mask: 0x03)                   */
#define VADC_G_ARBPR_CSM0_Pos                 (3UL)                     /*!< VADC_G ARBPR: CSM0 (Bit 3)                                  */
#define VADC_G_ARBPR_CSM0_Msk                 (0x8UL)                   /*!< VADC_G ARBPR: CSM0 (Bitfield-Mask: 0x01)                    */
#define VADC_G_ARBPR_PRIO1_Pos                (4UL)                     /*!< VADC_G ARBPR: PRIO1 (Bit 4)                                 */
#define VADC_G_ARBPR_PRIO1_Msk                (0x30UL)                  /*!< VADC_G ARBPR: PRIO1 (Bitfield-Mask: 0x03)                   */
#define VADC_G_ARBPR_CSM1_Pos                 (7UL)                     /*!< VADC_G ARBPR: CSM1 (Bit 7)                                  */
#define VADC_G_ARBPR_CSM1_Msk                 (0x80UL)                  /*!< VADC_G ARBPR: CSM1 (Bitfield-Mask: 0x01)                    */
#define VADC_G_ARBPR_PRIO2_Pos                (8UL)                     /*!< VADC_G ARBPR: PRIO2 (Bit 8)                                 */
#define VADC_G_ARBPR_PRIO2_Msk                (0x300UL)                 /*!< VADC_G ARBPR: PRIO2 (Bitfield-Mask: 0x03)                   */
#define VADC_G_ARBPR_CSM2_Pos                 (11UL)                    /*!< VADC_G ARBPR: CSM2 (Bit 11)                                 */
#define VADC_G_ARBPR_CSM2_Msk                 (0x800UL)                 /*!< VADC_G ARBPR: CSM2 (Bitfield-Mask: 0x01)                    */
#define VADC_G_ARBPR_ASEN0_Pos                (24UL)                    /*!< VADC_G ARBPR: ASEN0 (Bit 24)                                */
#define VADC_G_ARBPR_ASEN0_Msk                (0x1000000UL)             /*!< VADC_G ARBPR: ASEN0 (Bitfield-Mask: 0x01)                   */
#define VADC_G_ARBPR_ASEN1_Pos                (25UL)                    /*!< VADC_G ARBPR: ASEN1 (Bit 25)                                */
#define VADC_G_ARBPR_ASEN1_Msk                (0x2000000UL)             /*!< VADC_G ARBPR: ASEN1 (Bitfield-Mask: 0x01)                   */
#define VADC_G_ARBPR_ASEN2_Pos                (26UL)                    /*!< VADC_G ARBPR: ASEN2 (Bit 26)                                */
#define VADC_G_ARBPR_ASEN2_Msk                (0x4000000UL)             /*!< VADC_G ARBPR: ASEN2 (Bitfield-Mask: 0x01)                   */

/* --------------------------------  VADC_G_CHASS  -------------------------------- */
#define VADC_G_CHASS_ASSCH0_Pos               (0UL)                     /*!< VADC_G CHASS: ASSCH0 (Bit 0)                                */
#define VADC_G_CHASS_ASSCH0_Msk               (0x1UL)                   /*!< VADC_G CHASS: ASSCH0 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH1_Pos               (1UL)                     /*!< VADC_G CHASS: ASSCH1 (Bit 1)                                */
#define VADC_G_CHASS_ASSCH1_Msk               (0x2UL)                   /*!< VADC_G CHASS: ASSCH1 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH2_Pos               (2UL)                     /*!< VADC_G CHASS: ASSCH2 (Bit 2)                                */
#define VADC_G_CHASS_ASSCH2_Msk               (0x4UL)                   /*!< VADC_G CHASS: ASSCH2 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH3_Pos               (3UL)                     /*!< VADC_G CHASS: ASSCH3 (Bit 3)                                */
#define VADC_G_CHASS_ASSCH3_Msk               (0x8UL)                   /*!< VADC_G CHASS: ASSCH3 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH4_Pos               (4UL)                     /*!< VADC_G CHASS: ASSCH4 (Bit 4)                                */
#define VADC_G_CHASS_ASSCH4_Msk               (0x10UL)                  /*!< VADC_G CHASS: ASSCH4 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH5_Pos               (5UL)                     /*!< VADC_G CHASS: ASSCH5 (Bit 5)                                */
#define VADC_G_CHASS_ASSCH5_Msk               (0x20UL)                  /*!< VADC_G CHASS: ASSCH5 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH6_Pos               (6UL)                     /*!< VADC_G CHASS: ASSCH6 (Bit 6)                                */
#define VADC_G_CHASS_ASSCH6_Msk               (0x40UL)                  /*!< VADC_G CHASS: ASSCH6 (Bitfield-Mask: 0x01)                  */
#define VADC_G_CHASS_ASSCH7_Pos               (7UL)                     /*!< VADC_G CHASS: ASSCH7 (Bit 7)                                */
#define VADC_G_CHASS_ASSCH7_Msk               (0x80UL)                  /*!< VADC_G CHASS: ASSCH7 (Bitfield-Mask: 0x01)                  */

/* --------------------------------  VADC_G_RRASS  -------------------------------- */
#define VADC_G_RRASS_ASSRR0_Pos               (0UL)                     /*!< VADC_G RRASS: ASSRR0 (Bit 0)                                */
#define VADC_G_RRASS_ASSRR0_Msk               (0x1UL)                   /*!< VADC_G RRASS: ASSRR0 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR1_Pos               (1UL)                     /*!< VADC_G RRASS: ASSRR1 (Bit 1)                                */
#define VADC_G_RRASS_ASSRR1_Msk               (0x2UL)                   /*!< VADC_G RRASS: ASSRR1 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR2_Pos               (2UL)                     /*!< VADC_G RRASS: ASSRR2 (Bit 2)                                */
#define VADC_G_RRASS_ASSRR2_Msk               (0x4UL)                   /*!< VADC_G RRASS: ASSRR2 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR3_Pos               (3UL)                     /*!< VADC_G RRASS: ASSRR3 (Bit 3)                                */
#define VADC_G_RRASS_ASSRR3_Msk               (0x8UL)                   /*!< VADC_G RRASS: ASSRR3 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR4_Pos               (4UL)                     /*!< VADC_G RRASS: ASSRR4 (Bit 4)                                */
#define VADC_G_RRASS_ASSRR4_Msk               (0x10UL)                  /*!< VADC_G RRASS: ASSRR4 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR5_Pos               (5UL)                     /*!< VADC_G RRASS: ASSRR5 (Bit 5)                                */
#define VADC_G_RRASS_ASSRR5_Msk               (0x20UL)                  /*!< VADC_G RRASS: ASSRR5 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR6_Pos               (6UL)                     /*!< VADC_G RRASS: ASSRR6 (Bit 6)                                */
#define VADC_G_RRASS_ASSRR6_Msk               (0x40UL)                  /*!< VADC_G RRASS: ASSRR6 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR7_Pos               (7UL)                     /*!< VADC_G RRASS: ASSRR7 (Bit 7)                                */
#define VADC_G_RRASS_ASSRR7_Msk               (0x80UL)                  /*!< VADC_G RRASS: ASSRR7 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR8_Pos               (8UL)                     /*!< VADC_G RRASS: ASSRR8 (Bit 8)                                */
#define VADC_G_RRASS_ASSRR8_Msk               (0x100UL)                 /*!< VADC_G RRASS: ASSRR8 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR9_Pos               (9UL)                     /*!< VADC_G RRASS: ASSRR9 (Bit 9)                                */
#define VADC_G_RRASS_ASSRR9_Msk               (0x200UL)                 /*!< VADC_G RRASS: ASSRR9 (Bitfield-Mask: 0x01)                  */
#define VADC_G_RRASS_ASSRR10_Pos              (10UL)                    /*!< VADC_G RRASS: ASSRR10 (Bit 10)                              */
#define VADC_G_RRASS_ASSRR10_Msk              (0x400UL)                 /*!< VADC_G RRASS: ASSRR10 (Bitfield-Mask: 0x01)                 */
#define VADC_G_RRASS_ASSRR11_Pos              (11UL)                    /*!< VADC_G RRASS: ASSRR11 (Bit 11)                              */
#define VADC_G_RRASS_ASSRR11_Msk              (0x800UL)                 /*!< VADC_G RRASS: ASSRR11 (Bitfield-Mask: 0x01)                 */
#define VADC_G_RRASS_ASSRR12_Pos              (12UL)                    /*!< VADC_G RRASS: ASSRR12 (Bit 12)                              */
#define VADC_G_RRASS_ASSRR12_Msk              (0x1000UL)                /*!< VADC_G RRASS: ASSRR12 (Bitfield-Mask: 0x01)                 */
#define VADC_G_RRASS_ASSRR13_Pos              (13UL)                    /*!< VADC_G RRASS: ASSRR13 (Bit 13)                              */
#define VADC_G_RRASS_ASSRR13_Msk              (0x2000UL)                /*!< VADC_G RRASS: ASSRR13 (Bitfield-Mask: 0x01)                 */
#define VADC_G_RRASS_ASSRR14_Pos              (14UL)                    /*!< VADC_G RRASS: ASSRR14 (Bit 14)                              */
#define VADC_G_RRASS_ASSRR14_Msk              (0x4000UL)                /*!< VADC_G RRASS: ASSRR14 (Bitfield-Mask: 0x01)                 */
#define VADC_G_RRASS_ASSRR15_Pos              (15UL)                    /*!< VADC_G RRASS: ASSRR15 (Bit 15)                              */
#define VADC_G_RRASS_ASSRR15_Msk              (0x8000UL)                /*!< VADC_G RRASS: ASSRR15 (Bitfield-Mask: 0x01)                 */

/* --------------------------------  VADC_G_ICLASS  ------------------------------- */
#define VADC_G_ICLASS_STCS_Pos                (0UL)                     /*!< VADC_G ICLASS: STCS (Bit 0)                                 */
#define VADC_G_ICLASS_STCS_Msk                (0x1fUL)                  /*!< VADC_G ICLASS: STCS (Bitfield-Mask: 0x1f)                   */
#define VADC_G_ICLASS_CMS_Pos                 (8UL)                     /*!< VADC_G ICLASS: CMS (Bit 8)                                  */
#define VADC_G_ICLASS_CMS_Msk                 (0x700UL)                 /*!< VADC_G ICLASS: CMS (Bitfield-Mask: 0x07)                    */
#define VADC_G_ICLASS_STCE_Pos                (16UL)                    /*!< VADC_G ICLASS: STCE (Bit 16)                                */
#define VADC_G_ICLASS_STCE_Msk                (0x1f0000UL)              /*!< VADC_G ICLASS: STCE (Bitfield-Mask: 0x1f)                   */
#define VADC_G_ICLASS_CME_Pos                 (24UL)                    /*!< VADC_G ICLASS: CME (Bit 24)                                 */
#define VADC_G_ICLASS_CME_Msk                 (0x7000000UL)             /*!< VADC_G ICLASS: CME (Bitfield-Mask: 0x07)                    */

/* --------------------------------  VADC_G_ALIAS  -------------------------------- */
#define VADC_G_ALIAS_ALIAS0_Pos               (0UL)                     /*!< VADC_G ALIAS: ALIAS0 (Bit 0)                                */
#define VADC_G_ALIAS_ALIAS0_Msk               (0x1fUL)                  /*!< VADC_G ALIAS: ALIAS0 (Bitfield-Mask: 0x1f)                  */
#define VADC_G_ALIAS_ALIAS1_Pos               (8UL)                     /*!< VADC_G ALIAS: ALIAS1 (Bit 8)                                */
#define VADC_G_ALIAS_ALIAS1_Msk               (0x1f00UL)                /*!< VADC_G ALIAS: ALIAS1 (Bitfield-Mask: 0x1f)                  */

